"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь:
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат
  работы функции в переменную
* Вывести содержимое переменной на экран

"""


def main() -> None:
    age: int = int(input("Введите возраст: \n"))
    res = decide_status(age)
    print(res)


def decide_status(age: int) -> str:
    if age < 7:
        return "Детский сад"
    elif age < 18:
        return "Школа"
    elif age < 22:
        return "Универ"
    else:
        return "Работа"


if __name__ == "__main__":
    main()
